pouriaMaleki/navon/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# The Waveshare ESP32-P4-Module-DEV-KIT ships with 32 MB of SPI flash.
# Without this the image header reports 4 MB and the bootloader warns
# "Detected size(32768k) larger than the size in the binary image header".
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y

# Custom partition layout. The `factory` slot is 4 MB (firmware is ~1 MB).
# The `map_data` slot follows at 0x400000 and ends at 0x1000000 (16 MB),
# staying within the range the ESP-IDF generic flash driver can mmap.
# The default `partitions_singleapp.csv` gives only 1 MB of factory space.
# embuild's `PROJECT_DIR` points at `/work/target`, not the crate source,
# so resolve the CSV via an absolute path rather than a crate-relative one.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="/work/firmware/partitions.csv"

# Watchdog / task stacks for a simple main loop.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_INIT=y

# Interrupt watchdog. The default 300 ms is too tight once the hosted-BLE
# stack is up: when esp_hosted's RPC layer retries a `Req_FeatureControl`
# against the older v0.0.6 C6 slave the synchronous wait holds the BTM
# task long enough that legacy-I2C (touch) polling stalls IRQ servicing,
# and HP_WDT fires ~1 minute after boot. 1 second is more than enough
# headroom while we still catch real lockups.
CONFIG_ESP_INT_WDT_TIMEOUT_MS=1000

# Log everything at INFO by default.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# Waveshare ESP32-P4-Module-DEV-KIT has 32MB HyperBus PSRAM (hex mode).
# We use PSRAM for the heap only — keep code/rodata in internal flash/SRAM.
# Code-placement options (FETCH_INSTRUCTIONS, RODATA, XIP_FROM_PSRAM) all
# enable ld's `--enable-non-contiguous-regions`, which discards orphan
# sections produced by `-Zbuild-std`. If the app outgrows internal SRAM
# we revisit flash XIP rather than PSRAM XIP to keep orphan handling sane.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
# CONFIG_SPIRAM_SPEED_200M is gated behind CONFIG_IDF_EXPERIMENTAL_FEATURES
# in ESP-IDF v5.4's Kconfig for esp32p4 — without that flag, kconfig
# silently selects SPIRAM_SPEED_20M. That default costs ~10x of the
# framebuffer bandwidth, which dominates the 800x800 render budget.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# Keep the SPIRAM malloc threshold at the default 16 KiB; small allocations
# stay on internal SRAM so touch / frame tick structs don't pay PSRAM latency.

# Speed-optimize IDF so the 2.56 MB framebuffer clear / blit path is not
# hobbled by -Os. The Rust side is still opt-level=s for binary size, but
# the hot render path is mostly in the Rust rasterizer (render-core), which
# is also set to opt-level=3 below via firmware/.cargo/config.toml.
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Disable C++ exceptions and RTTI so libstdc++'s eh_globals / type_info
# objects are not dragged into the link. The Rust binary does not need them.
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# --- Hosted BLE via the on-board ESP32-C6 ----------------------------------
#
# The P4 has no on-chip radio; the Waveshare 3.4C wires an ESP32-C6 to the
# P4 over SDIO and `espressif/esp_hosted` runs the Bluetooth controller +
# Wi-Fi MAC on the C6. The P4 only runs the host stack (Bluedroid for BLE).
#
# CONFIG_BT_CONTROLLER_DISABLED=y tells IDF "there is no on-chip controller
# under your control"; combined with esp_hosted's HCI driver, Bluedroid
# attaches to the virtual HCI and the standard `esp_ble_gap_*` /
# `esp_ble_gatts_*` APIs work transparently.

# Enable the BT subsystem and Bluedroid host. Classic BT and BR/EDR are
# off — the C6 only does BLE anyway.
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTS_ENABLE=y
# Bluedroid splits its API surface into BLE 4.2 (the legacy advertising/
# scan APIs we use: `esp_ble_gap_config_adv_data`,
# `esp_ble_gap_start_advertising`, `esp_ble_gap_stop_advertising`) and BLE
# 5.0 extended-advertising APIs. Without 4.2 features explicitly enabled,
# IDF compiles those symbols out and the link fails with `undefined
# reference to esp_ble_gap_*`. We don't need 5.0 extended advertising for
# the route-sync service — the 4.2 surface is enough.
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# One ATT MTU large enough to carry the BLE packet wire format (header
# block + chunk payload) without per-write fragmentation when the peer
# supports it. Companions cap MTU lower will simply negotiate down.
CONFIG_BT_GATT_MAX_MTU=512

# Enable the Security Manager Protocol so we can pair (Just Works at the
# link layer + custom QR-OOB confirmation on top — see
# `docs/ble-route-sync-contract.md`). Without these the chunk-write +
# event-notify chars stay unauthenticated and route traffic is in clear.
# `_BOND_NVS_FLASH` persists bonds across power cycles; the ESP-IDF v5.4
# `bt` component manages the NVS namespace internally.
CONFIG_BT_BLE_SMP_ENABLE=y
CONFIG_BT_BLE_SMP_BOND_NVS_FLASH=y

# esp_hosted: drive the C6 over SDIO. The transport pins are wired by the
# Waveshare 3.4C; esp_hosted's defaults match. Both the BT and Wi-Fi
# subsystems on the C6 ride this same SDIO link.
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_HOST_INTERFACE_SDIO=y
# Compile in `hosted_hci_bluedroid_*` and the VHCI bridge that
# `esp_bluedroid_attach_hci_driver` consumes. Without this Kconfig the
# whole `esp_hosted_bluedroid.c` source is excluded and the link fails
# with `undefined reference to hosted_hci_bluedroid_*`.
CONFIG_ESP_HOSTED_ENABLE_BT_BLUEDROID=y
CONFIG_ESP_HOSTED_BLUEDROID_HCI_VHCI=y

# Park esp_hosted's two long-running tasks (rx/tx + RPC) on PSRAM stacks.
# With the default (off) routing, the task buffers come out of internal
# DRAM via plain `xTaskCreate`. On the Waveshare P4 build, the small
# fragmented internal-DRAM region those allocations land in fails
# FreeRTOS's `xPortcheckValidStackMem` assert on boot — `kTaskCreate`
# inside esp_hosted's port layer panics before it ever opens the SDIO
# link. Routing those stacks through PSRAM puts them on the larger pool
# we already validated, and the matching `xTaskCreateStatic` path inside
# esp_hosted handles the static buffer setup. Permitted because we have
# CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y (set automatically when
# SPIRAM is enabled).
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y
